package exam;

public class Example01 {
	/*
	 * 상속
	 * - 부모 클래스가 가진 기능을 자식클래스에서 사용할 수 있다
	 * - 상속해주는 주는 클래스 : 부모클래스, 슈퍼클래스
	 * - 상속받는 클래스 : 자식클래스, 하위클래스
	 * - 자식클래스를 선언할 때 extends 라는 키워드를 사용해서
	 * 상속받을 클래스를 지정
	 * - 자바는 클래스간에 다중상속을 불허함 !!
	 * 
	 * 상속의 장점
	 * - 클래스간의 간결과, 클래스 관리 용이, 소프트웨어 생산성 향상
	 * 
	 * 클래스 간결 : 멤버의 중복 작성 불필요
	 * 클래스 관리 용이 : 클래스들의 계층적 분류
	 * 
	 * 형식)
	 * class A { => 부모클래스
	 * 
	 * }
	 * 
	 * class B extends A {
	 * 			// 자식클래스
	 * 			// B클래스는 A 클래스를 상속받는다 
	 * }
	 * 
	 */
}
